index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 
| search Image="*\rundll32.exe" CommandLine="*comsvcs.dll*MiniDump*"
| table _time, Computer, User, Image, CommandLine, ParentCommandLine
