title: Komut Satırı Üzerinden Windows Olay Günlüklerinin Silinmesi
id: c32a4e21-5a6b-482f-8b2b-63870634621e
status: stable
description: Savunmadan kaçınma eylemine işaret eden, Windows Olay Günlüklerini silmek için wevtutil kullanımını tespit eder.
author: Efekan Acar
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 1
        Image|endswith: '\wevtutil.exe'
        CommandLine|contains: ' cl '
    condition: selection
level: high
tags:
    - attack.defense_evasion
    - attack.t1070.001